// ---------------------------------------------------------  
// NormalEnemy.cs  
// 通常の敵
// 作成日:  3/13
// 作成者:  竹村綾人
// ---------------------------------------------------------  

public class NormalEnemy : EnemyBase {
  
    #region メソッド  
    
     /// <summary>  
     /// 更新前処理  
     /// </summary>  
     void Start ()
     {
        //敵のHPを設定
       // _hp = 100;
        ////敵の移動スピードを設定
        //_speed = 2;
        ////敵の攻撃力を設定
        //_power = 1;
        ////敵の所持金を設定
        //_money = 10;
    }

    #endregion
}
