// ---------------------------------------------------------  
// SpeedEnemy.cs  
// 足が早い敵
// 作成日:  3/14
// 作成者:  竹村綾人
// ---------------------------------------------------------  

public class SpeedEnemy : EnemyBase
{
    
    #region メソッド  
    
     /// <summary>  
     /// 更新前処理  
     /// </summary>  
     void Start ()
     {
        //敵のHPを設定
        //_hp = 80;
        ////敵の移動スピードを設定
        //_speed = 6;
        ////敵の攻撃力を設定
        //_power = 1;
        ////敵の所持金を設定
        //_money = 20;
    }

    #endregion
}
